---
title: GroupType
classe: Autodesk.Revit.DB.GroupType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# GroupType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `GroupSet Groups { get; }` | `groupType.Groups` | GroupSet |
| `ISet<ElementId> GetAvailableAttachedDetailGroupTypeIds()` | `groupType.GetAvailableAttachedDetailGroupTypeIds()` | ISet<ElementId> |
| `Void LoadFrom(String, GroupLoadOptions)` | `groupType.LoadFrom(fileName, options)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```